# Day 3 - Conditions and Loops

# -----------------------------
# تمرین 1 - تشخیص زوج یا فرد
# -----------------------------
num = int(input("یک عدد وارد کن: "))

if num % 2 == 0:
    print("عدد زوج است")
else:
    print("عدد فرد است")

print("-" * 40)  # جداکننده خروجی‌ها


# -----------------------------
# تمرین 2 - شمارش معکوس
# -----------------------------
print("شمارش معکوس:")

for i in range(10, 0, -1):  # از 10 شروع، تا 1، هر بار یکی کم کن
    print(i)

print("Boom!")

print("-" * 40)


# -----------------------------
# تمرین 3 - جمع اعداد 1 تا 100
# -----------------------------
total = 0
for i in range(1, 101):
    total += i

print("جمع اعداد 1 تا 100 برابر است با:", total)

print("-" * 40)
